[
    { "title": "My First Blog", "slug": "my-first-blog", "content": "This is my first test blog" },
    { "title": "Second Post", "slug": "second-post", "content": "Second blog to test functionality" },
    { "title": "The Shape of the Essay Field", "slug": "shape-of-essay-field", "content": "<strong>June 2025</strong> <p>An essay has to tell people something they don't already know. But there are three different reasons people might not know something, and they yield three very different kinds of essays.</p> <p>One reason people won't know something is if it's not important to know. That doesn't mean it will make a bad essay. For example, you might write a good essay about a particular model of car. Readers would learn something from it. It would add to their picture of the world. For a handful of readers it might even spur some kind of epiphany. But unless this is a very unusual car it's not critical for everyone to know about it. [1]</p> <p>If something isn't important to know, there's no answer to the question of why people don't know it. Not knowing random facts is the default. But if you're going to write about things that are important to know, you have to ask why your readers don't already know them. Is it because they're smart but inexperienced, or because they're obtuse?</p> <p>So the three reasons readers might not already know what you tell them are (a) that it's not important, (b) that they're obtuse, or (c) that they're inexperienced.</p> <p>The reason I did this breakdown was to get at the following fact, which might have seemed controversial if I'd led with it, but should be obvious now. If you're writing for smart people about important things, you're writing for the young.</p> <p>Or more precisely, that's where you'll have the most effect. Whatever you say should also be at least somewhat novel to you, however old you are. It's not an essay otherwise, because an essay is something you write to figure something out. But whatever you figure out will presumably be more of a surprise to younger readers than it is to you.</p>"},
    { "title": "Being a Noob", "slug": "being-a-noob", "content": "<strong>January 2020</strong> <p>When I was young, I thought old people had everything figured out. Now that I'm old, I know this isn't true.</p> <p>I constantly feel like a noob. It seems like I'm always talking to some startup working in a new field I know nothing about, or reading a book about a topic I don't understand well enough, or visiting some new country where I don't know how things work.</p> <p>It's not pleasant to feel like a noob. And the word \"noob\" is certainly not a compliment. And yet today I realized something encouraging about being a noob: the more of a noob you are locally, the less of a noob you are globally.</p> <p>For example, if you stay in your home country, you'll feel less of a noob than if you move to Farawavia, where everything works differently. And yet you'll know more if you move. So the feeling of being a noob is inversely correlated with actual ignorance.</p> <p>But if the feeling of being a noob is good for us, why do we dislike it? What evolutionary purpose could such an aversion serve?</p> <p>I think the answer is that there are two sources of feeling like a noob: being stupid, and doing something novel. Our dislike of feeling like a noob is our brain telling us \"Come on, come on, figure this out.\" Which was the right thing to be thinking for most of human history. The life of hunter-gatherers was complex, but it didn't change as much as life does now. They didn't suddenly have to figure out what to do about cryptocurrency. So it made sense to be biased toward competence at existing problems over the discovery of new ones. It made sense for humans to dislike the feeling of being a noob, just as, in a world where food was scarce, it made sense for them to dislike the feeling of being hungry.</p> <p>Now that too much food is more of a problem than too little, our dislike of feeling hungry leads us astray. And I think our dislike of feeling like a noob does too.</p> <p>Though it feels unpleasant, and people will sometimes ridicule you for it, the more you feel like a noob, the better.</p>" }
]